DROP DATABASE librery;

CREATE DATABASE IF NOT EXISTS library;

USE library;
CREATE TABLE books (
	title VARCHAR(120) NOT NULL,
    description VARCHAR(225) DEFAULT " Опис відсутній",
    release_of_publication DATE NOT NULL DEFAULT "2018-01-01",
    author VARCHAR(60) NOT NULL,
    category VARCHAR(30) NOT NULL
);

INSERT INTO books (title, description, release_of_publication, author, category)
VALUES
("Фантастичні звірі і де їх шукати",
" Підручник, по якому вчився усім відомий чарівник Гаррі Поттер та на сторінках якого він разом із своїми друзями робив кумедні нотатки.",
"2017-02-12",
"Джоан Роулінг",
"Фентезі"),
(
" “Дівчина у потягу”",
" Спочатку може здатись, що психологічний трилер “Дівчина у потягу” занадто затягнутий, однак, мабуть, це такий задум британської письменниці Поли Гоукінз. Адже чим більше сторінок ви перегортаєте, тим заплутанішим та більш захопливим стає сюжет.",
"2016-04-11",
"Пола Гоукінз",
"Детектив"),
(
" До зустрічі з тобою",
"Без любові життя людини було б сірим та й, мабуть, не мало б змісту. Саме це читач вловлює з кожної сторінки книги, головні герої якої кохали наперекір усім проблемам та труднощам. Адже коли жива надія, то можна пережити навіть найскладніші удари долі.",
"2020-01-09",
"Джоджо Мойєс",
"Романи про кохання");
(
"Анна Кареніна",
"Шедевр великого Льва Толстого, який увійшов у золотий фонд світової літератури. Можливо, кращий з романів про кохання, жіночу душу і жіночу трагедію. Роман Льва Толстого про трагічне кохання заміжньої дами Анни Кареніної і блискучого офіцера Вронського на тлі щасливого сімейного життя дворян Костянтина Левіна і Кіті Щербацької.",
"1873-02-15",
"Лев Толстой",
"Роман ")
(
"Гордість та упередження",
"Елізабет Беннет — друга з п'яти доньок містера Беннета. Містер Беннет не багатий і економічне становище його родини залежить від родового маєтку, який після його смерті повинен перейти до спадкоємця по чоловічій лінії, а, отже, родина опиниться без засобів існування. Доньок украй необхідно одружити. Це головна турбота місіс Бенет, його дружини й матері Елізабет. Ліззі розумна, незалежна, горда, але не особливо красива — красуня в родині найстарша сестра Джейн.",
"1813-06-25",
"Джейн Остін",
" Романтичний Романи ");


INSERT INTO books (title, author, category)
VALUES 
(" Крадійка книжок",
"Маркус Зузак",
"Фантастика"),
("Пригоди Шерлока Холмса",
"Артур Конан Дойл",
 "Детектив"),
("Віднесені вітром",
"Маргарет Мітчелл",
"Любовний роман"),
("Гамлет",
"Уильям Шекспир",
"Трагедія "),
("На самоті з собою",
"Марк Аврелій ",
"Роздум ");


SELECT * FROM books;

